# Quiz 1

Please attempt answering the following questions and submit your notebook on pdf format in Brightspace.

Don't forget to add your name and NetID

Don't forget to import the proper libraries.

### Question 1

Manipulate list1 and list2 as defined below:


```python
list1=['One', 'Four', 'Three', 'Two', 'Five']
list2=['Zero']
```

To create the new lists:
```python
['One', 'Two', 'Three', 'Four', 'Five']

['ZERO','ONE', 'TWO', 'THREE', 'FOUR', 'FIVE']
```

**Suggested Answer:**

In [1]:
list1=['One', 'Four', 'Three', 'Two', 'Five']
list2=['Zero']

#For the first list just do the placeholder trick

firstlist=list1

placeholder=list1[1]

firstlist[1]=list1[3]

firstlist[3]=placeholder

firstlist

['One', 'Two', 'Three', 'Four', 'Five']

In [2]:
#We can just concatenate the list we just made with list2 and then do .upper()

concatenated=list2+firstlist

secondlist=[item.upper() for item in concatenated]

secondlist

['ZERO', 'ONE', 'TWO', 'THREE', 'FOUR', 'FIVE']

### Question 2

Write a piece of code that will output a list that will add 6 to every element of list3 below: 

```python
list3=[74,84,94,104,134]
```

**Suggested Answer:**

In [3]:
# We can just do a list comprehension

list3=[74,84,94,104,134]

[x+6 for x in list3]

[80, 90, 100, 110, 140]

### Question 3

Write a function that will calculate the absolute difference of any float and 24. This means that If I input the number 37, the function should output 13 and if I input 23 the output should be 1. 

**Suggested Answer:**

In [4]:
#The function

def diff24(x):
    # We take the difference
    diff=24-x
    # For the positives
    if diff>=0:
        return(diff)
    # For the negatives
    else:
        return(diff*(-1))

In [5]:
# Trying 37

diff24(x=37)

13

In [6]:
#Trying 23

diff24(x=23)

1

### Question 4

The lists below correspond to some test takers, the number of attempts they had on a test and their final score.
Please turn the lists into a pandas dataframe and from that dataframe generate a second one that contains only the names and scores of the people who only took the test once. 

```python
name=['Albert', 'Dean', 'Karen', 'Jim', 'Ella', 'Mark', 'Michael', 'Laura', 'Kirk', 'Joseph']
score= [12.5, 9, 16.5, 12, 9, 20, 14.5, 7, 8, 19]
attemtps=[3, 1, 2, 3, 2, 1, 1, 2, 2, 1]
```

**Suggested Answer:**

In [7]:
import pandas as pd

name=['Albert', 'Dean', 'Karen', 'Jim', 'Ella', 'Mark', 'Michael', 'Laura', 'Kirk', 'Joseph']
score= [12.5, 9, 16.5, 12, 9, 20, 14.5, 7, 8, 19]
attemtps=[3, 1, 2, 3, 2, 1, 1, 2, 2, 1]

firstdf=pd.DataFrame({'name':name,'score': score,'attempts': attemtps})

In [8]:
firstdf

      name  score  attempts
0   Albert   12.5         3
1     Dean    9.0         1
2    Karen   16.5         2
3      Jim   12.0         3
4     Ella    9.0         2
5     Mark   20.0         1
6  Michael   14.5         1
7    Laura    7.0         2
8     Kirk    8.0         2
9   Joseph   19.0         1

In [9]:
firstdf.loc[firstdf['attempts']==1, ['name', 'score']]

      name  score
1     Dean    9.0
5     Mark   20.0
6  Michael   14.5
9   Joseph   19.0